*** crates/keel-core/src/id.rs:109:5: replace next_ulid -> ulid::Ulid with Default::default()

*** mutation diff:
--- crates/keel-core/src/id.rs
+++ replace next_ulid -> ulid::Ulid with Default::default()
@@ -101,21 +101,17 @@
 /// Mint the next monotonically increasing ULID.
 ///
 /// Both fallbacks are unreachable in practice and neither justifies failing a
 /// write: a poisoned mutex means another thread panicked mid-mint, and
 /// `Overflow` needs 2^80 ids inside one millisecond. Degrading to a
 /// non-monotonic id keeps the write alive at the cost of ordering *within that
 /// single millisecond*, which is strictly better than losing the write.
 fn next_ulid() -> ulid::Ulid {
-    let mut guard = match GENERATOR.lock() {
-        Ok(g) => g,
-        Err(poisoned) => poisoned.into_inner(),
-    };
-    guard.generate().unwrap_or_else(|_| ulid::Ulid::new())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generate a fresh prefixed identifier.
 fn mint(prefix: &str) -> String {
     format!("{prefix}_{}", next_ulid())
 }
 
 /// Validate the `<prefix>_<ulid>` shape and return the two halves.

---- id::tests::ids_sort_chronologically stdout ----

thread 'id::tests::ids_sort_chronologically' (32381452) panicked at crates/keel-core/src/id.rs:377:9:
assertion `left == right` failed: no collisions
  left: 1
 right: 50

---- store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction stdout ----

thread 'store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction' (32381493) panicked at crates/keel-core/src/store/docs.rs:899:14:
called `Result::unwrap()` on an `Err` value: SqliteFailure(Error { code: ConstraintViolation, extended_code: 1555 }, Some("UNIQUE constraint failed: design_artifacts.id"))

---- store::docs::tests::a_diff_shows_the_changed_line stdout ----

thread 'store::docs::tests::a_diff_shows_the_changed_line' (32381496) panicked at crates/keel-core/src/store/docs.rs:791:14:
called `Result::unwrap()` on an `Err` value: Storage { context: "write revision 2 of spc_00000000000000000000000000", source: SqliteFailure(Error { code: ConstraintViolation, extended_code: 1555 }, Some("UNIQUE constraint failed: documents.doc_id")) }

failures:
    id::tests::ids_sort_chronologically
    store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction
    store::docs::tests::a_diff_shows_the_changed_line
    store::docs::tests::exactly_one_revision_is_current_after_several_writes
    store::docs::tests::identical_content_is_not_a_new_revision
    store::docs::tests::revisions_come_back_oldest_first
    store::docs::tests::the_header_row_points_at_the_newest_revision
    store::docs::tests::the_returned_version_is_the_one_the_store_assigned
    store::docs::tests::three_revisions_round_trip_and_only_the_last_is_current
    store::entity::tests::a_caller_supplied_key_is_not_second_guessed_on_a_similar_title
    store::entity::tests::a_list_excludes_archived_rows_unless_asked
    store::entity::tests::a_lists_truncation_is_reported_with_a_total

test result: FAILED. 224 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
