*** crates/keel-core/src/id.rs:118:5: replace mint -> String with "xyzzy".into()

*** mutation diff:
--- crates/keel-core/src/id.rs
+++ replace mint -> String with "xyzzy".into()
@@ -110,17 +110,17 @@
         Ok(g) => g,
         Err(poisoned) => poisoned.into_inner(),
     };
     guard.generate().unwrap_or_else(|_| ulid::Ulid::new())
 }
 
 /// Generate a fresh prefixed identifier.
 fn mint(prefix: &str) -> String {
-    format!("{prefix}_{}", next_ulid())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validate the `<prefix>_<ulid>` shape and return the two halves.
 fn split(supplied: &str, expected_shape: &str) -> Result<(String, String)> {
     let malformed = |problem: String| Error::MalformedId {
         supplied: supplied.to_owned(),
         problem,
         expected: expected_shape.to_owned(),

---- document::tests::a_first_revision_is_version_one_with_no_parent stdout ----

thread 'document::tests::a_first_revision_is_version_one_with_no_parent' (32390089) panicked at crates/keel-core/src/document.rs:327:10:
called `Result::unwrap()` on an `Err` value: Invariant { operation: "write a spec document revision for xyzzy", problem: "the id belongs to a artifact, not a spec" }

---- document::tests::revisions_increment_from_their_parent stdout ----

thread 'document::tests::revisions_increment_from_their_parent' (32390092) panicked at crates/keel-core/src/document.rs:348:10:
called `Result::unwrap()` on an `Err` value: Invariant { operation: "write a spec document revision for xyzzy", problem: "the id belongs to a artifact, not a spec" }

---- document::tests::searchable_text_includes_the_title stdout ----

thread 'document::tests::searchable_text_includes_the_title' (32390093) panicked at crates/keel-core/src/document.rs:407:10:
called `Result::unwrap()` on an `Err` value: Invariant { operation: "write a decision document revision for xyzzy", problem: "the id belongs to a artifact, not a decision" }

failures:
    document::tests::a_first_revision_is_version_one_with_no_parent
    document::tests::revisions_increment_from_their_parent
    document::tests::searchable_text_includes_the_title
    document::tests::the_id_must_match_the_declared_type
    id::tests::connective_ids_do_not_accept_each_others_prefixes
    id::tests::generated_ids_carry_their_type
    id::tests::ids_sort_chronologically
    id::tests::parse_as_rejects_the_wrong_type
    link::tests::a_missing_anchor_becomes_the_empty_string_not_null
    link::tests::neighbour_of_respects_direction
    store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction
    store::docs::tests::a_diff_against_a_missing_version_says_which_one

test result: FAILED. 173 passed; 113 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.68s

*** result: Failure(101)
