*** crates/keel-core/src/id.rs:123:5: replace split -> Result<(String, String)> with Ok((String::new(), "xyzzy".into()))

*** mutation diff:
--- crates/keel-core/src/id.rs
+++ replace split -> Result<(String, String)> with Ok((String::new(), "xyzzy".into()))
@@ -115,40 +115,17 @@
 
 /// Generate a fresh prefixed identifier.
 fn mint(prefix: &str) -> String {
     format!("{prefix}_{}", next_ulid())
 }
 
 /// Validate the `<prefix>_<ulid>` shape and return the two halves.
 fn split(supplied: &str, expected_shape: &str) -> Result<(String, String)> {
-    let malformed = |problem: String| Error::MalformedId {
-        supplied: supplied.to_owned(),
-        problem,
-        expected: expected_shape.to_owned(),
-    };
-
-    let Some((prefix, body)) = supplied.split_once('_') else {
-        return Err(malformed(
-            "no `_` separating the type prefix from the ULID".into(),
-        ));
-    };
-    if prefix.is_empty() {
-        return Err(malformed("the type prefix is empty".into()));
-    }
-    if body.len() != ULID_LEN {
-        return Err(malformed(format!(
-            "the part after `_` is {} characters, not {ULID_LEN}",
-            body.len()
-        )));
-    }
-    if ulid::Ulid::from_string(body).is_err() {
-        return Err(malformed("the part after `_` is not a valid ULID".into()));
-    }
-    Ok((prefix.to_owned(), body.to_owned()))
+    Ok((String::new(), "xyzzy".into())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The identifier of one of the thirteen artifact types.
 ///
 /// Construct with [`EntityId::generate`], or parse an existing one with
 /// [`EntityId::parse`]. There is deliberately no `From<String>`: an
 /// unvalidated identifier reaching the links table is the failure this type
 /// exists to prevent.

---- id::tests::connective_ids_do_not_accept_each_others_prefixes stdout ----

thread 'id::tests::connective_ids_do_not_accept_each_others_prefixes' (32398862) panicked at crates/keel-core/src/id.rs:398:9:
assertion failed: LinkId::parse(link.as_str()).is_ok()

---- id::tests::generated_ids_carry_their_type stdout ----

thread 'id::tests::generated_ids_carry_their_type' (32398863) panicked at crates/keel-core/src/id.rs:341:53:

---- id::tests::parse_as_rejects_the_wrong_type stdout ----

thread 'id::tests::parse_as_rejects_the_wrong_type' (32398866) panicked at crates/keel-core/src/id.rs:366:9:

failures:
    id::tests::connective_ids_do_not_accept_each_others_prefixes
    id::tests::generated_ids_carry_their_type
    id::tests::parse_as_rejects_the_wrong_type
    store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction
    store::docs::tests::a_diff_against_a_missing_version_says_which_one
    store::docs::tests::a_diff_shows_the_changed_line
    store::docs::tests::a_five_megabyte_blob_round_trips_byte_identically
    store::docs::tests::an_embedding_is_stored_as_little_endian_floats
    store::docs::tests::exactly_one_revision_is_current_after_several_writes
    store::docs::tests::identical_content_is_not_a_new_revision
    store::docs::tests::revisions_come_back_oldest_first
    store::docs::tests::the_header_row_points_at_the_newest_revision

test result: FAILED. 193 passed; 93 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
