*** crates/keel-core/src/id.rs:137:19: replace != with == in split

*** mutation diff:
--- crates/keel-core/src/id.rs
+++ replace != with == in split
@@ -129,17 +129,17 @@
     let Some((prefix, body)) = supplied.split_once('_') else {
         return Err(malformed(
             "no `_` separating the type prefix from the ULID".into(),
         ));
     };
     if prefix.is_empty() {
         return Err(malformed("the type prefix is empty".into()));
     }
-    if body.len() != ULID_LEN {
+    if body.len() == /* ~ changed by cargo-mutants ~ */ ULID_LEN {
         return Err(malformed(format!(
             "the part after `_` is {} characters, not {ULID_LEN}",
             body.len()
         )));
     }
     if ulid::Ulid::from_string(body).is_err() {
         return Err(malformed("the part after `_` is not a valid ULID".into()));
     }

---- id::tests::connective_ids_do_not_accept_each_others_prefixes stdout ----

thread 'id::tests::connective_ids_do_not_accept_each_others_prefixes' (32412015) panicked at crates/keel-core/src/id.rs:421:9:
assertion failed: LinkId::parse(link.as_str()).is_ok()

---- id::tests::generated_ids_carry_their_type stdout ----

thread 'id::tests::generated_ids_carry_their_type' (32412016) panicked at crates/keel-core/src/id.rs:364:53:
called `Result::unwrap()` on an `Err` value: MalformedId { supplied: "prj_01KZTN43JSNTA37Q8QJG4C344P", problem: "the part after `_` is 26 characters, not 26", expected: "a prefixed ULID such as `tsk_01H8XK4RPVBQ2N7DZM9C3FGTWY`" }

---- id::tests::parse_as_rejects_the_wrong_type stdout ----

thread 'id::tests::parse_as_rejects_the_wrong_type' (32412019) panicked at crates/keel-core/src/id.rs:389:9:
malformed id `spc_01KZTN43JT5AY7QYEG6QK3J6YY`: the part after `_` is 26 characters, not 26. Expected: a prefixed ULID such as `tsk_01H8XK4RPVBQ2N7DZM9C3FGTWY`

failures:
    id::tests::connective_ids_do_not_accept_each_others_prefixes
    id::tests::generated_ids_carry_their_type
    id::tests::parse_as_rejects_the_wrong_type
    store::docs::tests::a_blob_and_its_entity_row_are_written_in_one_transaction
    store::docs::tests::a_diff_against_a_missing_version_says_which_one
    store::docs::tests::a_diff_shows_the_changed_line
    store::docs::tests::a_five_megabyte_blob_round_trips_byte_identically
    store::docs::tests::an_embedding_is_stored_as_little_endian_floats
    store::docs::tests::exactly_one_revision_is_current_after_several_writes
    store::docs::tests::identical_content_is_not_a_new_revision
    store::docs::tests::revisions_come_back_oldest_first
    store::docs::tests::the_header_row_points_at_the_newest_revision

test result: FAILED. 193 passed; 93 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
