*** crates/keel-core/src/id.rs:218:19: replace != with == in EntityId::parse_as

*** mutation diff:
--- crates/keel-core/src/id.rs
+++ replace != with == in EntityId::parse_as
@@ -210,17 +210,17 @@
     /// Parse an identifier and require it to be of a particular type.
     ///
     /// Used wherever an argument is typed by position rather than by name — a
     /// `milestone_id` field that receives `spc_…` is a caller bug worth
     /// rejecting immediately rather than storing and puzzling over later.
     pub fn parse_as(supplied: &str, expected: EntityType) -> Result<Self> {
         let id = Self::parse(supplied)?;
         let actual = id.entity_type();
-        if actual != expected {
+        if actual == /* ~ changed by cargo-mutants ~ */ expected {
             return Err(Error::MalformedId {
                 supplied: supplied.to_owned(),
                 problem: format!("this is a {actual} id, but a {expected} id is required here"),
                 expected: format!("an id beginning `{}_`", expected.prefix()),
             });
         }
         Ok(id)
     }

---- id::tests::parse_as_rejects_the_wrong_type stdout ----

thread 'id::tests::parse_as_rejects_the_wrong_type' (32416709) panicked at crates/keel-core/src/id.rs:387:76:
called `Result::unwrap_err()` on an `Ok` value: EntityId("spc_01KZTN4TRBC1MCX0SXV1A0EV0F")

failures:
    id::tests::parse_as_rejects_the_wrong_type

test result: FAILED. 285 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
