*** crates/keel-core/src/next.rs:190:5: replace rank -> Result<NextUp> with Ok(Default::default())

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace rank -> Result<NextUp> with Ok(Default::default())
@@ -182,163 +182,17 @@
     }
     Ok(blocked)
 }
 
 /// Rank a project's open work.
 pub fn rank(store: &(impl EntityStore + GraphStore), project_id: &EntityId) -> Result<NextUp> {
     // Fetched once for the whole ranking rather than per candidate: the key is
     // the only part of a readable identifier that does not live on the task.
-    let key = match store.get(project_id)? {
-        Some(Entity::Project(p)) => p.key,
-        _ => String::new(),
-    };
-
-    let page = store.list(
-        &EntityQuery::in_project(project_id.clone())
-            .of_type(EntityType::Task)
-            .limited(5_000),
-    )?;
-
-    // Open means "still wants doing". `review` counts: it is waiting on a
-    // person to confirm, not finished.
-    let open: Vec<_> = page
-        .items
-        .iter()
-        .filter_map(|e| match e {
-            Entity::Task(t) if !is_closed(t.status) => Some(t),
-            _ => None,
-        })
-        .collect();
-    let open_ids: std::collections::HashSet<&EntityId> = open.iter().map(|t| &t.id).collect();
-
-    // Every `blocks` edge in the project, once, rather than two traversals per
-    // open task. Same reasoning as `blocked_tasks`, and the same answer.
-    let edges = store.links_in_project(project_id, Relation::Blocks)?;
-    let mut blockers_of: std::collections::HashMap<&EntityId, Vec<&EntityId>> = Default::default();
-    let mut blocks_what: std::collections::HashMap<&EntityId, Vec<&EntityId>> = Default::default();
-    for link in &edges {
-        blockers_of
-            .entry(&link.to_id)
-            .or_default()
-            .push(&link.from_id);
-        blocks_what
-            .entry(&link.from_id)
-            .or_default()
-            .push(&link.to_id);
-    }
-    let known: std::collections::HashMap<&EntityId, &Entity> =
-        page.items.iter().map(|e| (e.id(), e)).collect();
-
-    let mut out = NextUp::default();
-    // Blockers from outside the task page, resolved once each rather than once
-    // per task that names them.
-    let mut fetched: std::collections::HashMap<EntityId, Option<Entity>> = Default::default();
-
-    for task in &open {
-        // Inbound `blocks` edges — what is stopping this. Only live blockers
-        // count: a blocker that is finished is not a blocker, and leaving it
-        // in would freeze work forever behind something already done.
-        //
-        // Fail closed here too, for the same reason as `blocked_tasks`: an
-        // unreadable blocker becomes a named blocker rather than no blocker,
-        // so this task stays off the ready list. The label says why, because a
-        // blocked task with no visible reason is its own kind of dead end.
-        let mut blockers: Vec<String> = Vec::new();
-        for blocker in blockers_of.get(&task.id).map(Vec::as_slice).unwrap_or(&[]) {
-            if let Some(entity) = known.get(*blocker) {
-                if is_live(entity) {
-                    blockers.push(entity.label().to_owned());
-                }
-                continue;
-            }
-            if !fetched.contains_key(*blocker) {
-                let resolved = match store.get(blocker) {
-                    Ok(found) => found,
-                    Err(e) => {
-                        tracing::warn!(
-                            task = %task.id,
-                            blocker = %blocker,
-                            error = %e,
-                            "could not read a blocker while ranking"
-                        );
-                        blockers.push(format!("{blocker} (unreadable — run `keel fsck`)"));
-                        continue;
-                    }
-                };
-                fetched.insert((*blocker).clone(), resolved);
-            }
-            if let Some(Some(entity)) = fetched.get(*blocker)
-                && is_live(entity)
-            {
-                blockers.push(entity.label().to_owned());
-            }
-        }
-
-        // Outbound `blocks` edges to work that is still open — what finishing
-        // this would release.
-        let unblocks = blocks_what
-            .get(&task.id)
-            .map(Vec::as_slice)
-            .unwrap_or(&[])
-            .iter()
-            .filter(|id| open_ids.contains(**id))
-            .count();
-
-        let priority = task.priority.as_str().to_owned();
-        let waiting = task.labels.iter().any(|l| l == DECISION_LABEL);
-
-        if !blockers.is_empty() {
-            out.blocked.push(Candidate {
-                id: task.id.clone(),
-                reference: format!("{key}-{}", task.number),
-                title: task.title.clone(),
-                priority,
-                unblocks,
-                why: format!("blocked by {}", join_names(&blockers)),
-            });
-        } else if waiting {
-            out.waiting_on_you.push(Candidate {
-                id: task.id.clone(),
-                reference: format!("{key}-{}", task.number),
-                title: task.title.clone(),
-                priority,
-                unblocks,
-                why: "a decision, not work — nothing can start until it is made".to_owned(),
-            });
-        } else {
-            out.ready.push(Candidate {
-                id: task.id.clone(),
-                reference: format!("{key}-{}", task.number),
-                title: task.title.clone(),
-                priority,
-                unblocks,
-                why: reason(unblocks, task.priority.as_str()),
-            });
-        }
-    }
-
-    out.ready.sort_by(|a, b| {
-        b.unblocks
-            .cmp(&a.unblocks)
-            .then_with(|| a.priority.cmp(&b.priority))
-            .then_with(|| a.id.as_str().cmp(b.id.as_str()))
-    });
-    out.waiting_on_you.sort_by(|a, b| {
-        a.priority
-            .cmp(&b.priority)
-            .then_with(|| a.id.as_str().cmp(b.id.as_str()))
-    });
-    out.blocked.sort_by(|a, b| {
-        a.priority
-            .cmp(&b.priority)
-            .then_with(|| a.id.as_str().cmp(b.id.as_str()))
-    });
-
-    Ok(out)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// What to narrow `keel ready` to.
 ///
 /// Every field is "no opinion" by default, so an empty filter is the whole ready
 /// list. That matters for the promise the three surfaces make: the CLI, the tool
 /// and the app all call [`ready`], and a default that meant something would be a
 /// fourth answer nobody asked for.

---- a_task_with_nothing_blocking_it_is_ready stdout ----

thread 'a_task_with_nothing_blocking_it_is_ready' (32479443) panicked at crates/keel-core/tests/next.rs:321:5:
and it is therefore work someone can pick up

---- an_unreadable_blocker_names_itself_in_the_reason stdout ----

thread 'an_unreadable_blocker_names_itself_in_the_reason' (32479445) panicked at crates/keel-core/tests/next.rs:541:10:
the task is blocked

---- decisions_waiting_on_a_human_do_not_compete_with_work stdout ----

thread 'decisions_waiting_on_a_human_do_not_compete_with_work' (32479447) panicked at crates/keel-core/tests/next.rs:291:5:
assertion `left == right` failed: a p0 decision must not outrank real work in the ready list — nobody can start it
  left: []
 right: [EntityId("tsk_01KZTNW19H60NV19913YD5Y1WD")]

failures:
    a_blocked_task_is_never_offered_as_ready_and_names_its_blocker
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    a_task_with_nothing_blocking_it_is_ready
    an_unreadable_blocker_keeps_the_task_off_the_ready_list
    an_unreadable_blocker_names_itself_in_the_reason
    an_unresolved_question_blocks_but_an_answered_one_does_not
    decisions_waiting_on_a_human_do_not_compete_with_work
    finishing_the_blocker_releases_the_work
    labels_narrow_the_list_in_both_directions
    priority_breaks_the_tie_when_nothing_is_blocked
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person

test result: FAILED. 2 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
