*** crates/keel-core/src/next.rs:191:9: delete match arm Some(Entity::Project(p)) in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete match arm Some(Entity::Project(p)) in rank
@@ -183,17 +183,17 @@
     Ok(blocked)
 }
 
 /// Rank a project's open work.
 pub fn rank(store: &(impl EntityStore + GraphStore), project_id: &EntityId) -> Result<NextUp> {
     // Fetched once for the whole ranking rather than per candidate: the key is
     // the only part of a readable identifier that does not live on the task.
     let key = match store.get(project_id)? {
-        Some(Entity::Project(p)) => p.key,
+         /* ~ changed by cargo-mutants ~ */
         _ => String::new(),
     };
 
     let page = store.list(
         &EntityQuery::in_project(project_id.clone())
             .of_type(EntityType::Task)
             .limited(5_000),
     )?;

*** result: Success
