*** crates/keel-core/src/next.rs:207:32: replace match guard !is_closed(t.status) with true in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace match guard !is_closed(t.status) with true in rank
@@ -199,17 +199,17 @@
     )?;
 
     // Open means "still wants doing". `review` counts: it is waiting on a
     // person to confirm, not finished.
     let open: Vec<_> = page
         .items
         .iter()
         .filter_map(|e| match e {
-            Entity::Task(t) if !is_closed(t.status) => Some(t),
+            Entity::Task(t) if true /* ~ changed by cargo-mutants ~ */ => Some(t),
             _ => None,
         })
         .collect();
     let open_ids: std::collections::HashSet<&EntityId> = open.iter().map(|t| &t.id).collect();
 
     // Every `blocks` edge in the project, once, rather than two traversals per
     // open task. Same reasoning as `blocked_tasks`, and the same answer.
     let edges = store.links_in_project(project_id, Relation::Blocks)?;

---- done_work_is_not_ranked_and_an_empty_project_says_so stdout ----

thread 'done_work_is_not_ranked_and_an_empty_project_says_so' (32490288) panicked at crates/keel-core/tests/next.rs:337:5:
closed work must not reappear as something to pick up

---- finishing_the_blocker_releases_the_work stdout ----

thread 'finishing_the_blocker_releases_the_work' (32490289) panicked at crates/keel-core/tests/next.rs:242:5:
assertion `left == right` failed: a finished blocker stops blocking. Leaving the edge in force would freeze work permanently behind something already done
  left: Some(EntityId("tsk_01KZTP0858FKTBBSG0F5ZWK2R9"))
 right: Some(EntityId("tsk_01KZTP085CEQJ3M4F1J0AKXB57"))

failures:
    done_work_is_not_ranked_and_an_empty_project_says_so
    finishing_the_blocker_releases_the_work

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
