*** crates/keel-core/src/next.rs:207:32: replace match guard !is_closed(t.status) with false in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace match guard !is_closed(t.status) with false in rank
@@ -199,17 +199,17 @@
     )?;
 
     // Open means "still wants doing". `review` counts: it is waiting on a
     // person to confirm, not finished.
     let open: Vec<_> = page
         .items
         .iter()
         .filter_map(|e| match e {
-            Entity::Task(t) if !is_closed(t.status) => Some(t),
+            Entity::Task(t) if false /* ~ changed by cargo-mutants ~ */ => Some(t),
             _ => None,
         })
         .collect();
     let open_ids: std::collections::HashSet<&EntityId> = open.iter().map(|t| &t.id).collect();
 
     // Every `blocks` edge in the project, once, rather than two traversals per
     // open task. Same reasoning as `blocked_tasks`, and the same answer.
     let edges = store.links_in_project(project_id, Relation::Blocks)?;

---- a_task_with_nothing_blocking_it_is_ready stdout ----

thread 'a_task_with_nothing_blocking_it_is_ready' (32495757) panicked at crates/keel-core/tests/next.rs:321:5:
and it is therefore work someone can pick up

---- an_unresolved_question_blocks_but_an_answered_one_does_not stdout ----

thread 'an_unresolved_question_blocks_but_an_answered_one_does_not' (32495760) panicked at crates/keel-core/tests/next.rs:281:5:
assertion `left == right` failed
  left: None
 right: Some(EntityId("tsk_01KZTP1Z33WREE1Z3RBFCZ14PY"))

---- a_blocked_task_is_never_offered_as_ready_and_names_its_blocker stdout ----

thread 'a_blocked_task_is_never_offered_as_ready_and_names_its_blocker' (32495755) panicked at crates/keel-core/tests/next.rs:223:64:
called `Option::unwrap()` on a `None` value

failures:
    a_blocked_task_is_never_offered_as_ready_and_names_its_blocker
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    a_task_with_nothing_blocking_it_is_ready
    an_unreadable_blocker_keeps_the_task_off_the_ready_list
    an_unreadable_blocker_names_itself_in_the_reason
    an_unresolved_question_blocks_but_an_answered_one_does_not
    decisions_waiting_on_a_human_do_not_compete_with_work
    finishing_the_blocker_releases_the_work
    labels_narrow_the_list_in_both_directions
    priority_breaks_the_tie_when_nothing_is_blocked
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person

test result: FAILED. 2 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
