*** crates/keel-core/src/next.rs:253:16: delete ! in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete ! in rank
@@ -245,17 +245,17 @@
         let mut blockers: Vec<String> = Vec::new();
         for blocker in blockers_of.get(&task.id).map(Vec::as_slice).unwrap_or(&[]) {
             if let Some(entity) = known.get(*blocker) {
                 if is_live(entity) {
                     blockers.push(entity.label().to_owned());
                 }
                 continue;
             }
-            if !fetched.contains_key(*blocker) {
+            if  /* ~ changed by cargo-mutants ~ */fetched.contains_key(*blocker) {
                 let resolved = match store.get(blocker) {
                     Ok(found) => found,
                     Err(e) => {
                         tracing::warn!(
                             task = %task.id,
                             blocker = %blocker,
                             error = %e,
                             "could not read a blocker while ranking"

---- an_unreadable_blocker_keeps_the_task_off_the_ready_list stdout ----

thread 'an_unreadable_blocker_keeps_the_task_off_the_ready_list' (32506916) panicked at crates/keel-core/tests/next.rs:510:5:
the task appeared on the ready list despite an unreadable blocker

---- an_unreadable_blocker_names_itself_in_the_reason stdout ----

thread 'an_unreadable_blocker_names_itself_in_the_reason' (32506917) panicked at crates/keel-core/tests/next.rs:541:10:
the task is blocked

---- an_unresolved_question_blocks_but_an_answered_one_does_not stdout ----

thread 'an_unresolved_question_blocks_but_an_answered_one_does_not' (32506918) panicked at crates/keel-core/tests/next.rs:262:5:
an open question is a real blocker

failures:
    an_unreadable_blocker_keeps_the_task_off_the_ready_list
    an_unreadable_blocker_names_itself_in_the_reason
    an_unresolved_question_blocks_but_an_answered_one_does_not

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
