*** crates/keel-core/src/next.rs:287:52: replace == with != in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace == with != in rank
@@ -279,17 +279,17 @@
             .get(&task.id)
             .map(Vec::as_slice)
             .unwrap_or(&[])
             .iter()
             .filter(|id| open_ids.contains(**id))
             .count();
 
         let priority = task.priority.as_str().to_owned();
-        let waiting = task.labels.iter().any(|l| l == DECISION_LABEL);
+        let waiting = task.labels.iter().any(|l| l != /* ~ changed by cargo-mutants ~ */ DECISION_LABEL);
 
         if !blockers.is_empty() {
             out.blocked.push(Candidate {
                 id: task.id.clone(),
                 reference: format!("{key}-{}", task.number),
                 title: task.title.clone(),
                 priority,
                 unblocks,

---- decisions_waiting_on_a_human_do_not_compete_with_work stdout ----

thread 'decisions_waiting_on_a_human_do_not_compete_with_work' (32512767) panicked at crates/keel-core/tests/next.rs:291:5:
assertion `left == right` failed: a p0 decision must not outrank real work in the ready list — nobody can start it
  left: [EntityId("tsk_01KZTP8554WCSP8H07CV54K7SN"), EntityId("tsk_01KZTP85598S0N9KDKWWX29W80")]
 right: [EntityId("tsk_01KZTP85598S0N9KDKWWX29W80")]

---- ready_skips_what_is_blocked_and_what_is_waiting_on_a_person stdout ----

thread 'ready_skips_what_is_blocked_and_what_is_waiting_on_a_person' (32512773) panicked at crates/keel-core/tests/next.rs:468:5:
a decision is not work — nothing can start on it until a person answers

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32512770) panicked at crates/keel-core/tests/next.rs:400:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    decisions_waiting_on_a_human_do_not_compete_with_work
    labels_narrow_the_list_in_both_directions
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
