*** crates/keel-core/src/next.rs:289:12: delete ! in rank

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete ! in rank
@@ -281,17 +281,17 @@
             .unwrap_or(&[])
             .iter()
             .filter(|id| open_ids.contains(**id))
             .count();
 
         let priority = task.priority.as_str().to_owned();
         let waiting = task.labels.iter().any(|l| l == DECISION_LABEL);
 
-        if !blockers.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */blockers.is_empty() {
             out.blocked.push(Candidate {
                 id: task.id.clone(),
                 reference: format!("{key}-{}", task.number),
                 title: task.title.clone(),
                 priority,
                 unblocks,
                 why: format!("blocked by {}", join_names(&blockers)),
             });

---- a_task_with_nothing_blocking_it_is_ready stdout ----

thread 'a_task_with_nothing_blocking_it_is_ready' (32518393) panicked at crates/keel-core/tests/next.rs:317:5:
nothing links to it, so nothing is blocking it

---- an_unreadable_blocker_keeps_the_task_off_the_ready_list stdout ----

thread 'an_unreadable_blocker_keeps_the_task_off_the_ready_list' (32518394) panicked at crates/keel-core/tests/next.rs:510:5:
the task appeared on the ready list despite an unreadable blocker

---- a_blocked_task_is_never_offered_as_ready_and_names_its_blocker stdout ----

thread 'a_blocked_task_is_never_offered_as_ready_and_names_its_blocker' (32518391) panicked at crates/keel-core/tests/next.rs:219:5:
a p0 with something in its way is not ready, however urgent it is

failures:
    a_blocked_task_is_never_offered_as_ready_and_names_its_blocker
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    a_task_with_nothing_blocking_it_is_ready
    an_unreadable_blocker_keeps_the_task_off_the_ready_list
    an_unreadable_blocker_names_itself_in_the_reason
    an_unresolved_question_blocks_but_an_answered_one_does_not
    decisions_waiting_on_a_human_do_not_compete_with_work
    finishing_the_blocker_releases_the_work
    labels_narrow_the_list_in_both_directions
    priority_breaks_the_tie_when_nothing_is_blocked
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person

test result: FAILED. 2 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
