*** crates/keel-core/src/next.rs:389:5: replace ready -> Result<Ready> with Ok(Default::default())

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace ready -> Result<Ready> with Ok(Default::default())
@@ -381,91 +381,17 @@
 /// This adds the front door and the filters, and it is the one computation the
 /// CLI, the MCP tool and the app all read — which is what stops the app showing
 /// a different answer from the one a session was given.
 pub fn ready(
     store: &(impl EntityStore + GraphStore),
     project_id: &EntityId,
     filter: &ReadyFilter,
 ) -> Result<Ready> {
-    let ranked = rank(store, project_id)?;
-
-    // Parents are excluded by id, which needs the whole task list rather than
-    // only the ranked one: a parent whose children are all done is still a
-    // parent, and its child may be closed and therefore absent from `ranked`.
-    let page = store.list(
-        &EntityQuery::in_project(project_id.clone())
-            .of_type(EntityType::Task)
-            .limited(5_000),
-    )?;
-    let parents: std::collections::HashSet<EntityId> = page
-        .items
-        .iter()
-        .filter_map(|e| match e {
-            Entity::Task(t) => t.parent_id.clone(),
-            _ => None,
-        })
-        .collect();
-    let by_id: std::collections::HashMap<&EntityId, &crate::Task> = page
-        .items
-        .iter()
-        .filter_map(|e| match e {
-            Entity::Task(t) => Some((&t.id, t)),
-            _ => None,
-        })
-        .collect();
-
-    let now = chrono::Utc::now();
-    let mut items: Vec<Candidate> = Vec::new();
-    for candidate in ranked.ready {
-        let Some(task) = by_id.get(&candidate.id) else {
-            continue;
-        };
-        if parents.contains(&candidate.id) {
-            continue;
-        }
-        if filter.unclaimed && task.claim_is_live(now) {
-            continue;
-        }
-        if !filter
-            .labels
-            .iter()
-            .all(|want| task.labels.iter().any(|l| l == want))
-        {
-            continue;
-        }
-        if filter
-            .without_labels
-            .iter()
-            .any(|skip| task.labels.iter().any(|l| l == skip))
-        {
-            continue;
-        }
-        if let Some(milestone) = &filter.milestone
-            && task.milestone_id.as_ref() != Some(milestone)
-        {
-            continue;
-        }
-        items.push(candidate);
-    }
-
-    let total = items.len();
-    let truncated = match filter.limit {
-        Some(limit) if total > limit => {
-            items.truncate(limit);
-            true
-        }
-        _ => false,
-    };
-
-    Ok(Ready {
-        items,
-        total,
-        truncated,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Why a ready task sits where it does.
 fn reason(unblocks: usize, priority: &str) -> String {
     match (unblocks, priority) {
         (0, p) => format!("nothing is blocking it · {p}"),
         (1, p) => format!("unblocks 1 other task · {p}"),
         (n, p) => format!("unblocks {n} other tasks · {p}"),

---- a_limited_list_reports_that_it_was_cut_and_how_much_there_was stdout ----

thread 'a_limited_list_reports_that_it_was_cut_and_how_much_there_was' (32523952) panicked at crates/keel-core/tests/next.rs:439:5:
assertion `left == right` failed
  left: 0
 right: 2

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32523961) panicked at crates/keel-core/tests/next.rs:400:5:
assertion `left == right` failed
  left: 0
 right: 1

---- ready_offers_the_children_and_not_the_parent stdout ----

thread 'ready_offers_the_children_and_not_the_parent' (32523963) panicked at crates/keel-core/tests/next.rs:359:5:
the child is the work, so it is what gets offered

failures:
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    labels_narrow_the_list_in_both_directions
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person
    unclaimed_hides_what_somebody_is_already_doing

test result: FAILED. 12 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
