*** crates/keel-core/src/next.rs:403:13: delete match arm Entity::Task(t) in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete match arm Entity::Task(t) in ready
@@ -395,17 +395,17 @@
         &EntityQuery::in_project(project_id.clone())
             .of_type(EntityType::Task)
             .limited(5_000),
     )?;
     let parents: std::collections::HashSet<EntityId> = page
         .items
         .iter()
         .filter_map(|e| match e {
-            Entity::Task(t) => t.parent_id.clone(),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         })
         .collect();
     let by_id: std::collections::HashMap<&EntityId, &crate::Task> = page
         .items
         .iter()
         .filter_map(|e| match e {
             Entity::Task(t) => Some((&t.id, t)),

---- ready_offers_the_children_and_not_the_parent stdout ----

thread 'ready_offers_the_children_and_not_the_parent' (32529762) panicked at crates/keel-core/tests/next.rs:363:5:
a parent is a container for its children — offering both puts one job in the list twice, with the vaguer of the two ranked higher

failures:
    ready_offers_the_children_and_not_the_parent

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
