*** crates/keel-core/src/next.rs:411:13: delete match arm Entity::Task(t) in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete match arm Entity::Task(t) in ready
@@ -403,17 +403,17 @@
             Entity::Task(t) => t.parent_id.clone(),
             _ => None,
         })
         .collect();
     let by_id: std::collections::HashMap<&EntityId, &crate::Task> = page
         .items
         .iter()
         .filter_map(|e| match e {
-            Entity::Task(t) => Some((&t.id, t)),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         })
         .collect();
 
     let now = chrono::Utc::now();
     let mut items: Vec<Candidate> = Vec::new();
     for candidate in ranked.ready {
         let Some(task) = by_id.get(&candidate.id) else {

---- a_limited_list_reports_that_it_was_cut_and_how_much_there_was stdout ----

thread 'a_limited_list_reports_that_it_was_cut_and_how_much_there_was' (32534738) panicked at crates/keel-core/tests/next.rs:439:5:
assertion `left == right` failed
  left: 0
 right: 2

---- ready_offers_the_children_and_not_the_parent stdout ----

thread 'ready_offers_the_children_and_not_the_parent' (32534749) panicked at crates/keel-core/tests/next.rs:359:5:
the child is the work, so it is what gets offered

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32534746) panicked at crates/keel-core/tests/next.rs:400:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    labels_narrow_the_list_in_both_directions
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person
    unclaimed_hides_what_somebody_is_already_doing

test result: FAILED. 12 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
