*** crates/keel-core/src/next.rs:425:29: replace && with || in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace && with || in ready
@@ -417,17 +417,17 @@
     let mut items: Vec<Candidate> = Vec::new();
     for candidate in ranked.ready {
         let Some(task) = by_id.get(&candidate.id) else {
             continue;
         };
         if parents.contains(&candidate.id) {
             continue;
         }
-        if filter.unclaimed && task.claim_is_live(now) {
+        if filter.unclaimed || /* ~ changed by cargo-mutants ~ */ task.claim_is_live(now) {
             continue;
         }
         if !filter
             .labels
             .iter()
             .all(|want| task.labels.iter().any(|l| l == want))
         {
             continue;

---- unclaimed_hides_what_somebody_is_already_doing stdout ----

thread 'unclaimed_hides_what_somebody_is_already_doing' (32539780) panicked at crates/keel-core/tests/next.rs:378:5:
assertion `left == right` failed: a claim does not stop work being ready
  left: 1
 right: 2

failures:
    unclaimed_hides_what_somebody_is_already_doing

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
