*** crates/keel-core/src/next.rs:428:12: delete ! in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete ! in ready
@@ -420,17 +420,17 @@
             continue;
         };
         if parents.contains(&candidate.id) {
             continue;
         }
         if filter.unclaimed && task.claim_is_live(now) {
             continue;
         }
-        if !filter
+        if  /* ~ changed by cargo-mutants ~ */filter
             .labels
             .iter()
             .all(|want| task.labels.iter().any(|l| l == want))
         {
             continue;
         }
         if filter
             .without_labels

---- a_limited_list_reports_that_it_was_cut_and_how_much_there_was stdout ----

thread 'a_limited_list_reports_that_it_was_cut_and_how_much_there_was' (32544804) panicked at crates/keel-core/tests/next.rs:439:5:
assertion `left == right` failed
  left: 0
 right: 2

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32544813) panicked at crates/keel-core/tests/next.rs:401:5:
assertion `left == right` failed
  left: EntityId("tsk_01KZTPNDHX8WSC4V9NHKFER4A3")
 right: EntityId("tsk_01KZTPNDHQGFDWJQX05DKGP2PA")

---- ready_offers_the_children_and_not_the_parent stdout ----

thread 'ready_offers_the_children_and_not_the_parent' (32544815) panicked at crates/keel-core/tests/next.rs:359:5:
the child is the work, so it is what gets offered

failures:
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was
    labels_narrow_the_list_in_both_directions
    ready_offers_the_children_and_not_the_parent
    ready_skips_what_is_blocked_and_what_is_waiting_on_a_person
    unclaimed_hides_what_somebody_is_already_doing

test result: FAILED. 12 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
