*** crates/keel-core/src/next.rs:431:54: replace == with != in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace == with != in ready
@@ -423,17 +423,17 @@
             continue;
         }
         if filter.unclaimed && task.claim_is_live(now) {
             continue;
         }
         if !filter
             .labels
             .iter()
-            .all(|want| task.labels.iter().any(|l| l == want))
+            .all(|want| task.labels.iter().any(|l| l != /* ~ changed by cargo-mutants ~ */ want))
         {
             continue;
         }
         if filter
             .without_labels
             .iter()
             .any(|skip| task.labels.iter().any(|l| l == skip))
         {

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32550597) panicked at crates/keel-core/tests/next.rs:400:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    labels_narrow_the_list_in_both_directions

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
