*** crates/keel-core/src/next.rs:438:54: replace == with != in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace == with != in ready
@@ -430,17 +430,17 @@
             .iter()
             .all(|want| task.labels.iter().any(|l| l == want))
         {
             continue;
         }
         if filter
             .without_labels
             .iter()
-            .any(|skip| task.labels.iter().any(|l| l == skip))
+            .any(|skip| task.labels.iter().any(|l| l != /* ~ changed by cargo-mutants ~ */ skip))
         {
             continue;
         }
         if let Some(milestone) = &filter.milestone
             && task.milestone_id.as_ref() != Some(milestone)
         {
             continue;
         }

---- labels_narrow_the_list_in_both_directions stdout ----

thread 'labels_narrow_the_list_in_both_directions' (32556668) panicked at crates/keel-core/tests/next.rs:407:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    labels_narrow_the_list_in_both_directions

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
