*** crates/keel-core/src/next.rs:452:24: replace match guard total > limit with true in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace match guard total > limit with true in ready
@@ -444,17 +444,17 @@
         {
             continue;
         }
         items.push(candidate);
     }
 
     let total = items.len();
     let truncated = match filter.limit {
-        Some(limit) if total > limit => {
+        Some(limit) if true /* ~ changed by cargo-mutants ~ */ => {
             items.truncate(limit);
             true
         }
         _ => false,
     };
 
     Ok(Ready {
         items,

---- a_limited_list_reports_that_it_was_cut_and_how_much_there_was stdout ----

thread 'a_limited_list_reports_that_it_was_cut_and_how_much_there_was' (32570718) panicked at crates/keel-core/tests/next.rs:450:5:
a limit that happens to equal the count did not cut anything

failures:
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
