*** crates/keel-core/src/next.rs:452:30: replace > with < in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace > with < in ready
@@ -444,17 +444,17 @@
         {
             continue;
         }
         items.push(candidate);
     }
 
     let total = items.len();
     let truncated = match filter.limit {
-        Some(limit) if total > limit => {
+        Some(limit) if total < /* ~ changed by cargo-mutants ~ */ limit => {
             items.truncate(limit);
             true
         }
         _ => false,
     };
 
     Ok(Ready {
         items,

---- a_limited_list_reports_that_it_was_cut_and_how_much_there_was stdout ----

thread 'a_limited_list_reports_that_it_was_cut_and_how_much_there_was' (32588419) panicked at crates/keel-core/tests/next.rs:439:5:
assertion `left == right` failed
  left: 5
 right: 2

failures:
    a_limited_list_reports_that_it_was_cut_and_how_much_there_was

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
