*** crates/keel-core/src/next.rs:452:30: replace > with >= in ready

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace > with >= in ready
@@ -444,17 +444,17 @@
         {
             continue;
         }
         items.push(candidate);
     }
 
     let total = items.len();
     let truncated = match filter.limit {
-        Some(limit) if total > limit => {
+        Some(limit) if total >= /* ~ changed by cargo-mutants ~ */ limit => {
             items.truncate(limit);
             true
         }
         _ => false,
     };
 
     Ok(Ready {
         items,

*** result: Timeout
