*** crates/keel-core/src/next.rs:468:5: replace reason -> String with "xyzzy".into()

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace reason -> String with "xyzzy".into()
@@ -460,21 +460,17 @@
         items,
         total,
         truncated,
     })
 }
 
 /// Why a ready task sits where it does.
 fn reason(unblocks: usize, priority: &str) -> String {
-    match (unblocks, priority) {
-        (0, p) => format!("nothing is blocking it · {p}"),
-        (1, p) => format!("unblocks 1 other task · {p}"),
-        (n, p) => format!("unblocks {n} other tasks · {p}"),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Join blocker names for a one-line reason, without a trailing comma soup.
 fn join_names(names: &[String]) -> String {
     match names {
         [] => String::new(),
         [one] => format!("“{one}”"),
         [one, two] => format!("“{one}” and “{two}”"),

*** result: Timeout
