*** crates/keel-core/src/next.rs:487:5: replace is_closed -> bool with false

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace is_closed -> bool with false
@@ -479,17 +479,17 @@
         [one] => format!("“{one}”"),
         [one, two] => format!("“{one}” and “{two}”"),
         [one, rest @ ..] => format!("“{one}” and {} other(s)", rest.len()),
     }
 }
 
 /// Whether a task is finished as far as ranking is concerned.
 fn is_closed(status: TaskStatus) -> bool {
-    matches!(status, TaskStatus::Done | TaskStatus::WontDo)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Whether a blocker is still standing.
 ///
 /// A done task and an answered question stop blocking. Anything else — a spec,
 /// a decision, an open question — still counts, because there is no general
 /// notion of a "finished" spec and assuming one would quietly release work
 /// that is genuinely waiting.

*** result: Timeout
