*** crates/keel-core/src/next.rs:497:5: replace is_live -> bool with true

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace is_live -> bool with true
@@ -489,17 +489,10 @@
 
 /// Whether a blocker is still standing.
 ///
 /// A done task and an answered question stop blocking. Anything else — a spec,
 /// a decision, an open question — still counts, because there is no general
 /// notion of a "finished" spec and assuming one would quietly release work
 /// that is genuinely waiting.
 fn is_live(entity: &Entity) -> bool {
-    if entity.audit().archived_at.is_some() {
-        return false;
-    }
-    match entity {
-        Entity::Task(t) => !is_closed(t.status),
-        Entity::Question(q) => q.status.is_unresolved(),
-        _ => true,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Timeout
