*** crates/keel-core/src/next.rs:502:9: delete match arm Entity::Question(q) in is_live

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ delete match arm Entity::Question(q) in is_live
@@ -494,12 +494,12 @@
 /// notion of a "finished" spec and assuming one would quietly release work
 /// that is genuinely waiting.
 fn is_live(entity: &Entity) -> bool {
     if entity.audit().archived_at.is_some() {
         return false;
     }
     match entity {
         Entity::Task(t) => !is_closed(t.status),
-        Entity::Question(q) => q.status.is_unresolved(),
+         /* ~ changed by cargo-mutants ~ */
         _ => true,
     }
 }

*** result: Timeout
