*** crates/keel-core/src/next.rs:80:9: replace NextUp::is_empty -> bool with false

*** mutation diff:
--- crates/keel-core/src/next.rs
+++ replace NextUp::is_empty -> bool with false
@@ -72,17 +72,17 @@
     pub waiting_on_you: Vec<Candidate>,
     /// Stuck, with the blocker named.
     pub blocked: Vec<Candidate>,
 }
 
 impl NextUp {
     /// Whether there is anything at all to report.
     pub fn is_empty(&self) -> bool {
-        self.ready.is_empty() && self.waiting_on_you.is_empty() && self.blocked.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The open tasks in a project that something live is linked to as a blocker.
 ///
 /// **The** definition of blocked, and the only one. It used to be two — this,
 /// and a `blocked` value in the status column — which could and did disagree:
 /// two tasks were marked blocked with nothing linked to them at all. The status

---- done_work_is_not_ranked_and_an_empty_project_says_so stdout ----

thread 'done_work_is_not_ranked_and_an_empty_project_says_so' (32462286) panicked at crates/keel-core/tests/next.rs:330:5:
a project with no open work has no next action

failures:
    done_work_is_not_ranked_and_an_empty_project_says_so

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
