*** crates/keel-core/src/safe_path.rs:136:8: delete ! in validate_root_path

*** mutation diff:
--- crates/keel-core/src/safe_path.rs
+++ delete ! in validate_root_path
@@ -128,17 +128,17 @@
         return refuse("the path is empty".to_owned());
     }
     if value.contains('\0') {
         return refuse("the path contains a NUL byte".to_owned());
     }
     if value.starts_with('~') {
         return Ok(());
     }
-    if !Path::new(value).is_absolute() {
+    if  /* ~ changed by cargo-mutants ~ */Path::new(value).is_absolute() {
         return refuse(format!(
             "`{value}` is relative, so which repository it names depends on where the daemon \
              was started"
         ));
     }
     Ok(())
 }

---- safe_path::tests::a_root_path_must_be_absolute stdout ----

thread 'safe_path::tests::a_root_path_must_be_absolute' (32680638) panicked at crates/keel-core/src/safe_path.rs:275:9:
assertion failed: validate_root_path("/Users/kb/development/keel").is_ok()

failures:
    safe_path::tests::a_root_path_must_be_absolute

test result: FAILED. 285 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
