*** crates/keel-core/src/safe_path.rs:155:5: replace confine -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- crates/keel-core/src/safe_path.rs
+++ replace confine -> Result<PathBuf> with Ok(Default::default())
@@ -147,46 +147,17 @@
 /// The second layer, run immediately before every write. It repeats
 /// [`validate_repo_relative`]'s lexical checks — cheap — and adds the one they
 /// cannot do: resolving both sides and asserting the target is still underneath
 /// the root, which is what catches a symlinked directory inside the repository.
 ///
 /// Returns the joined path, so the call site reads `let path = confine(root,
 /// relative)?;` and there is no unchecked `join` left for someone to copy.
 pub fn confine(root: &Path, relative: &str) -> Result<PathBuf> {
-    let escape = |problem: String| Error::Invariant {
-        operation: format!("write the generated file `{relative}`"),
-        problem,
-    };
-
-    // The lexical rules, as an invariant rather than a validation error: by the
-    // time a value reaches here it is already stored, so this is Keel refusing
-    // to act on its own bad data rather than telling a caller off.
-    if let Err(e) = validate_repo_relative(EntityType::Project, "path", relative) {
-        return Err(escape(e.to_string()));
-    }
-
-    let joined = root.join(relative);
-
-    // Resolve as much of each side as exists. The target file usually does not
-    // yet — that is the point of generating it — so canonicalising the whole
-    // path would fail for every new file.
-    let resolved_root = resolve_existing(root);
-    let resolved_target = resolve_existing(&joined);
-
-    if !resolved_target.starts_with(&resolved_root) {
-        return Err(escape(format!(
-            "`{relative}` resolves to {}, which is outside the project at {}. A directory in the \
-             path is probably a symlink pointing out of the repository",
-            resolved_target.display(),
-            resolved_root.display()
-        )));
-    }
-
-    Ok(joined)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Canonicalise the deepest ancestor that exists, then re-append the rest.
 ///
 /// `std::fs::canonicalize` fails on a path whose last components do not exist,
 /// which is every file about to be generated. Walking up to the first real
 /// directory resolves the symlinks that matter — they can only be on components
 /// that exist — and leaves the rest as written.

---- safe_path::tests::confine_joins_a_good_path_under_the_root stdout ----

thread 'safe_path::tests::confine_joins_a_good_path_under_the_root' (32685824) panicked at crates/keel-core/src/safe_path.rs:256:9:
assertion failed: path.ends_with("product/SPEC.md")

---- safe_path::tests::confine_refuses_what_the_validator_refuses stdout ----

thread 'safe_path::tests::confine_refuses_what_the_validator_refuses' (32685826) panicked at crates/keel-core/src/safe_path.rs:262:9:
assertion failed: confine(dir.path(), "../escape.md").is_err()

---- safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo stdout ----

thread 'safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo' (32685825) panicked at crates/keel-core/src/safe_path.rs:276:14:
a symlink out of the repository should be refused: ""

failures:
    safe_path::tests::confine_joins_a_good_path_under_the_root
    safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo
    safe_path::tests::confine_refuses_what_the_validator_refuses

test result: FAILED. 283 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
