*** crates/keel-core/src/safe_path.rs:175:8: delete ! in confine

*** mutation diff:
--- crates/keel-core/src/safe_path.rs
+++ delete ! in confine
@@ -167,17 +167,17 @@
     let joined = root.join(relative);
 
     // Resolve as much of each side as exists. The target file usually does not
     // yet — that is the point of generating it — so canonicalising the whole
     // path would fail for every new file.
     let resolved_root = resolve_existing(root);
     let resolved_target = resolve_existing(&joined);
 
-    if !resolved_target.starts_with(&resolved_root) {
+    if  /* ~ changed by cargo-mutants ~ */resolved_target.starts_with(&resolved_root) {
         return Err(escape(format!(
             "`{relative}` resolves to {}, which is outside the project at {}. A directory in the \
              path is probably a symlink pointing out of the repository",
             resolved_target.display(),
             resolved_root.display()
         )));
     }

---- safe_path::tests::confine_joins_a_good_path_under_the_root stdout ----

thread 'safe_path::tests::confine_joins_a_good_path_under_the_root' (32690830) panicked at crates/keel-core/src/safe_path.rs:284:59:

---- safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works stdout ----

thread 'safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works' (32690827) panicked at crates/keel-core/src/safe_path.rs:317:9:
assertion failed: confine(dir.path(), "product/SPEC.md").is_ok()

---- safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo stdout ----

thread 'safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo' (32690831) panicked at crates/keel-core/src/safe_path.rs:305:14:
a symlink out of the repository should be refused: "/var/folders/jj/p9j3r_k512j8cqgnrps7q1bc0000gn/T/.tmpiSSLjh/product/SPEC.md"

failures:
    safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works
    safe_path::tests::confine_joins_a_good_path_under_the_root
    safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo

test result: FAILED. 283 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.67s

*** result: Failure(101)
