*** crates/keel-core/src/safe_path.rs:194:5: replace resolve_existing -> PathBuf with Default::default()

*** mutation diff:
--- crates/keel-core/src/safe_path.rs
+++ replace resolve_existing -> PathBuf with Default::default()
@@ -186,38 +186,17 @@
 
 /// Canonicalise the deepest ancestor that exists, then re-append the rest.
 ///
 /// `std::fs::canonicalize` fails on a path whose last components do not exist,
 /// which is every file about to be generated. Walking up to the first real
 /// directory resolves the symlinks that matter — they can only be on components
 /// that exist — and leaves the rest as written.
 fn resolve_existing(path: &Path) -> PathBuf {
-    let mut tail: Vec<&std::ffi::OsStr> = Vec::new();
-    let mut probe = path;
-
-    loop {
-        if let Ok(real) = probe.canonicalize() {
-            let mut out = real;
-            for part in tail.iter().rev() {
-                out.push(part);
-            }
-            return out;
-        }
-        match (probe.file_name(), probe.parent()) {
-            (Some(name), Some(parent)) => {
-                tail.push(name);
-                probe = parent;
-            }
-            // Nothing on this path exists at all. Hand back what we were given
-            // rather than inventing something: the caller's comparison then
-            // fails closed, which is the right direction.
-            _ => return path.to_path_buf(),
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 mod tests {
     use super::*;
 
     fn ok(value: &str) -> bool {

---- safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo stdout ----

thread 'safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo' (32695718) panicked at crates/keel-core/src/safe_path.rs:284:14:
a symlink out of the repository should be refused: "/var/folders/jj/p9j3r_k512j8cqgnrps7q1bc0000gn/T/.tmp0ElLAV/product/SPEC.md"

failures:
    safe_path::tests::confine_refuses_a_symlinked_directory_that_leaves_the_repo

test result: FAILED. 285 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
