*** crates/keel-core/src/safe_path.rs:206:13: delete match arm (Some(name), Some(parent)) in resolve_existing

*** mutation diff:
--- crates/keel-core/src/safe_path.rs
+++ delete match arm (Some(name), Some(parent)) in resolve_existing
@@ -198,20 +198,17 @@
         if let Ok(real) = probe.canonicalize() {
             let mut out = real;
             for part in tail.iter().rev() {
                 out.push(part);
             }
             return out;
         }
         match (probe.file_name(), probe.parent()) {
-            (Some(name), Some(parent)) => {
-                tail.push(name);
-                probe = parent;
-            }
+             /* ~ changed by cargo-mutants ~ */
             // Nothing on this path exists at all. Hand back what we were given
             // rather than inventing something: the caller's comparison then
             // fails closed, which is the right direction.
             _ => return path.to_path_buf(),
         }
     }
 }

---- safe_path::tests::confine_joins_a_good_path_under_the_root stdout ----

thread 'safe_path::tests::confine_joins_a_good_path_under_the_root' (32700557) panicked at crates/keel-core/src/safe_path.rs:281:59:

---- safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works stdout ----

thread 'safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works' (32700554) panicked at crates/keel-core/src/safe_path.rs:314:9:
assertion failed: confine(dir.path(), "product/SPEC.md").is_ok()

failures:
    safe_path::tests::a_root_that_is_itself_reached_through_a_symlink_still_works
    safe_path::tests::confine_joins_a_good_path_under_the_root

test result: FAILED. 284 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.71s

*** result: Failure(101)
