*** crates/keel-core/src/store/graph.rs:115:48: delete ! in read_neighbour

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ delete ! in read_neighbour
@@ -107,17 +107,17 @@
 
     // The stored path is `|root|a|b|`; the empty fragments either side of the
     // outer bars are what the filter drops.
     let raw_path = row
         .get::<_, Option<String>>("path")
         .map_err(e("path"))?
         .unwrap_or_default();
     let mut path = Vec::new();
-    for step in raw_path.split(BAR).filter(|s| !s.is_empty()) {
+    for step in raw_path.split(BAR).filter(|s|  /* ~ changed by cargo-mutants ~ */s.is_empty()) {
         path.push(EntityId::parse(step)?);
     }
 
     // A `LEFT JOIN`, so an edge pointing at a row that no longer resolves
     // yields an empty label rather than vanishing. Dropping it would hide the
     // exact breakage `fsck`'s dangling-link check exists to report.
     let label = row
         .get::<_, Option<String>>("label")

---- store::graph::tests::a_cycle_terminates stdout ----

thread 'store::graph::tests::a_cycle_terminates' (32754769) panicked at crates/keel-core/src/store/graph.rs:614:72:
called `Result::unwrap()` on an `Err` value: MalformedId { supplied: "", problem: "no `_` separating the type prefix from the ULID", expected: "a prefixed ULID such as `tsk_01H8XK4RPVBQ2N7DZM9C3FGTWY`" }

---- store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label stdout ----

thread 'store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label' (32754770) panicked at crates/keel-core/src/store/graph.rs:705:14:
called `Result::unwrap()` on an `Err` value: MalformedId { supplied: "", problem: "no `_` separating the type prefix from the ULID", expected: "a prefixed ULID such as `tsk_01H8XK4RPVBQ2N7DZM9C3FGTWY`" }

---- store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path stdout ----

thread 'store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path' (32754772) panicked at crates/keel-core/src/store/graph.rs:548:71:
called `Result::unwrap()` on an `Err` value: MalformedId { supplied: "", problem: "no `_` separating the type prefix from the ULID", expected: "a prefixed ULID such as `tsk_01H8XK4RPVBQ2N7DZM9C3FGTWY`" }

failures:
    store::graph::tests::a_cycle_terminates
    store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label
    store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path
    store::graph::tests::a_rels_filter_returns_only_what_was_asked_for
    store::graph::tests::an_archived_edge_is_not_walked
    store::graph::tests::blocks_runs_blocker_to_blocked
    store::graph::tests::both_unions_the_two_walks_without_wandering
    store::graph::tests::depends_on_is_never_stored_and_matches_nothing
    store::graph::tests::depth_is_clamped_to_max_depth
    store::graph::tests::derived_from_runs_spec_to_feedback
    store::graph::tests::duplicates_runs_task_to_task
    store::graph::tests::implements_runs_task_to_spec

test result: FAILED. 270 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
