*** crates/keel-core/src/store/graph.rs:146:9: replace <impl GraphStore for Store>::neighbours -> Result<Vec<Neighbour>> with Ok(vec![])

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace <impl GraphStore for Store>::neighbours -> Result<Vec<Neighbour>> with Ok(vec![])
@@ -138,95 +138,17 @@
 impl GraphStore for Store {
     fn neighbours(
         &self,
         root: &EntityId,
         direction: Direction,
         rels: &[Relation],
         depth: u8,
     ) -> Result<Vec<Neighbour>> {
-        let depth = depth.clamp(1, MAX_DEPTH);
-
-        if direction == Direction::Both {
-            // Run each way and merge, keeping the shallower reach when both
-            // find the same node. Expressing `Both` as one query would put the
-            // union inside the recursive term, where a node reached outbound
-            // could then be walked inbound — which is not "both directions", it
-            // is an undirected walk, and it would return things that stand in
-            // no stated relation to the root at all.
-            let mut out = self.neighbours(root, Direction::Outbound, rels, depth)?;
-            for n in self.neighbours(root, Direction::Inbound, rels, depth)? {
-                match out.iter_mut().find(|e| e.id == n.id) {
-                    Some(existing) if existing.depth > n.depth => *existing = n,
-                    Some(_) => {}
-                    None => out.push(n),
-                }
-            }
-            out.sort_by_key(|n| (n.depth, n.id.as_str().to_owned()));
-            return Ok(out);
-        }
-
-        let (match_col, yield_col, yield_type) = columns(direction);
-        let filter = rel_filter(rels);
-
-        let sql = format!(
-            "WITH RECURSIVE walk(id, entity_type, rel, anchor, depth, path) AS (
-                 SELECT l.{yield_col}, l.{yield_type}, l.rel, l.anchor,
-                        1,
-                        '{BAR}' || ?1 || '{BAR}' || l.{yield_col} || '{BAR}'
-                 FROM links l
-                 WHERE l.{match_col} = ?1 AND l.archived_at IS NULL AND {filter}
-               UNION ALL
-                 SELECT l.{yield_col}, l.{yield_type}, l.rel, l.anchor,
-                        w.depth + 1,
-                        w.path || l.{yield_col} || '{BAR}'
-                 FROM links l
-                 JOIN walk w ON l.{match_col} = w.id
-                 WHERE l.archived_at IS NULL AND {filter}
-                   AND w.depth < ?2
-                   AND instr(w.path, '{BAR}' || l.{yield_col} || '{BAR}') = 0
-             )
-             SELECT w.id AS id, w.entity_type AS entity_type, w.rel AS rel,
-                    w.anchor AS anchor, w.depth AS depth, w.path AS path,
-                    v.label AS label
-             FROM walk w LEFT JOIN v_entities v ON v.id = w.id
-             ORDER BY w.depth, w.id"
-        );
-
-        let mut stmt = self
-            .connection()
-            .prepare(&sql)
-            .map_err(Error::storage(format!(
-                "prepare a {direction} traversal from {root}"
-            )))?;
-        let mut rows = stmt
-            .query(params_from_iter(vec![
-                Value::Text(root.as_str().to_owned()),
-                Value::Integer(i64::from(depth)),
-            ]))
-            .map_err(Error::storage(format!(
-                "run a {direction} traversal from {root}"
-            )))?;
-
-        let mut out: Vec<Neighbour> = Vec::new();
-        while let Some(row) = rows
-            .next()
-            .map_err(Error::storage("read a traversal row"))?
-        {
-            // A node reachable by two paths appears twice. Keep the shorter,
-            // because "how far is this from the root" has one answer and it is
-            // the nearest one; `ORDER BY depth` means the first seen wins.
-            let neighbour = read_neighbour(row)?;
-            match out.iter().position(|n| n.id == neighbour.id) {
-                Some(i) if out[i].depth > neighbour.depth => out[i] = neighbour,
-                Some(_) => {}
-                None => out.push(neighbour),
-            }
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn links_of(&self, id: &EntityId, direction: Direction) -> Result<Vec<Link>> {
         let clause = match direction {
             Direction::Outbound => "from_id = ?1",
             Direction::Inbound => "to_id = ?1",
             Direction::Both => "from_id = ?1 OR to_id = ?1",
         };

---- store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label stdout ----

thread 'store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label' (32759849) panicked at crates/keel-core/src/store/graph.rs:628:9:
assertion `left == right` failed: the edge should survive even though its target does not
  left: []
 right: ["spc_01KZTSZ3SY3BRHQ5Z895Z5HANR"]

---- store::graph::tests::a_cycle_terminates stdout ----

thread 'store::graph::tests::a_cycle_terminates' (32759848) panicked at crates/keel-core/src/store/graph.rs:537:9:
assertion `left == right` failed: the walk should reach b and stop, not come back round to the root
  left: []
 right: ["tsk_01KZTSZ3SZVSNFXWEV2Y9Y2QED"]

---- store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path stdout ----

thread 'store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path' (32759851) panicked at crates/keel-core/src/store/graph.rs:471:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    store::graph::tests::a_cycle_terminates
    store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label
    store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path
    store::graph::tests::a_rels_filter_returns_only_what_was_asked_for
    store::graph::tests::an_archived_edge_is_not_walked
    store::graph::tests::blocks_runs_blocker_to_blocked
    store::graph::tests::both_unions_the_two_walks_without_wandering
    store::graph::tests::depends_on_is_never_stored_and_matches_nothing
    store::graph::tests::depth_is_clamped_to_max_depth
    store::graph::tests::derived_from_runs_spec_to_feedback
    store::graph::tests::duplicates_runs_task_to_task
    store::graph::tests::implements_runs_task_to_spec

test result: FAILED. 270 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.53s

*** result: Failure(101)
