*** crates/keel-core/src/store/graph.rs:148:22: replace == with != in <impl GraphStore for Store>::neighbours

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace == with != in <impl GraphStore for Store>::neighbours
@@ -140,17 +140,17 @@
         &self,
         root: &EntityId,
         direction: Direction,
         rels: &[Relation],
         depth: u8,
     ) -> Result<Vec<Neighbour>> {
         let depth = depth.clamp(1, MAX_DEPTH);
 
-        if direction == Direction::Both {
+        if direction != /* ~ changed by cargo-mutants ~ */ Direction::Both {
             // Run each way and merge, keeping the shallower reach when both
             // find the same node. Expressing `Both` as one query would put the
             // union inside the recursive term, where a node reached outbound
             // could then be walked inbound — which is not "both directions", it
             // is an undirected walk, and it would return things that stand in
             // no stated relation to the root at all.
             let mut out = self.neighbours(root, Direction::Outbound, rels, depth)?;
             for n in self.neighbours(root, Direction::Inbound, rels, depth)? {

*** result: Failure(101)
