*** crates/keel-core/src/store/graph.rs:157:52: replace == with != in <impl GraphStore for Store>::neighbours

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace == with != in <impl GraphStore for Store>::neighbours
@@ -149,17 +149,17 @@
             // Run each way and merge, keeping the shallower reach when both
             // find the same node. Expressing `Both` as one query would put the
             // union inside the recursive term, where a node reached outbound
             // could then be walked inbound — which is not "both directions", it
             // is an undirected walk, and it would return things that stand in
             // no stated relation to the root at all.
             let mut out = self.neighbours(root, Direction::Outbound, rels, depth)?;
             for n in self.neighbours(root, Direction::Inbound, rels, depth)? {
-                match out.iter_mut().find(|e| e.id == n.id) {
+                match out.iter_mut().find(|e| e.id != /* ~ changed by cargo-mutants ~ */ n.id) {
                     Some(existing) if existing.depth > n.depth => *existing = n,
                     Some(_) => {}
                     None => out.push(n),
                 }
             }
             out.sort_by_key(|n| (n.depth, n.id.as_str().to_owned()));
             return Ok(out);
         }

---- store::graph::tests::a_cycle_terminates stdout ----

thread 'store::graph::tests::a_cycle_terminates' (32784165) panicked at crates/keel-core/src/store/graph.rs:623:9:
assertion `left == right` failed
  left: 2
 right: 1

---- store::graph::tests::both_unions_the_two_walks_without_wandering stdout ----

thread 'store::graph::tests::both_unions_the_two_walks_without_wandering' (32784172) panicked at crates/keel-core/src/store/graph.rs:739:9:
assertion `left == right` failed: `Both` is two directed walks, not an undirected one
  left: ["tsk_01KZTTBW9GP05CY8AR94CJ1Q62"]
 right: ["tsk_01KZTTBW9GP05CY8AR94CJ1Q62", "tsk_01KZTTBW9H9874Q4S36TNJ5P7M"]

failures:
    store::graph::tests::a_cycle_terminates
    store::graph::tests::both_unions_the_two_walks_without_wandering

test result: FAILED. 284 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
