*** crates/keel-core/src/store/graph.rs:158:54: replace > with == in <impl GraphStore for Store>::neighbours

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace > with == in <impl GraphStore for Store>::neighbours
@@ -150,17 +150,17 @@
             // find the same node. Expressing `Both` as one query would put the
             // union inside the recursive term, where a node reached outbound
             // could then be walked inbound — which is not "both directions", it
             // is an undirected walk, and it would return things that stand in
             // no stated relation to the root at all.
             let mut out = self.neighbours(root, Direction::Outbound, rels, depth)?;
             for n in self.neighbours(root, Direction::Inbound, rels, depth)? {
                 match out.iter_mut().find(|e| e.id == n.id) {
-                    Some(existing) if existing.depth > n.depth => *existing = n,
+                    Some(existing) if existing.depth == /* ~ changed by cargo-mutants ~ */ n.depth => *existing = n,
                     Some(_) => {}
                     None => out.push(n),
                 }
             }
             out.sort_by_key(|n| (n.depth, n.id.as_str().to_owned()));
             return Ok(out);
         }

*** result: Timeout
