*** crates/keel-core/src/store/graph.rs:64:5: replace rel_filter -> String with "xyzzy".into()

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace rel_filter -> String with "xyzzy".into()
@@ -56,30 +56,17 @@
 /// there is no caller-supplied string anywhere in the output — and a bound `IN`
 /// list would need a placeholder count that varies with the argument.
 ///
 /// An empty request means every stored relation. A request naming only
 /// `depends_on` collapses to `FALSE`: it is never written, so the truthful
 /// answer is "no edges match" and not "all of them", which is what dropping an
 /// empty filter would have said.
 fn rel_filter(rels: &[Relation]) -> String {
-    let effective: Vec<Relation> = if rels.is_empty() {
-        Relation::STORED.to_vec()
-    } else {
-        rels.iter().copied().filter(|r| r.is_stored()).collect()
-    };
-    if effective.is_empty() {
-        return "0".to_owned();
-    }
-    let list = effective
-        .iter()
-        .map(|r| format!("'{}'", r.as_str()))
-        .collect::<Vec<_>>()
-        .join(", ");
-    format!("l.rel IN ({list})")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The columns a traversal matches on and yields, for one direction.
 ///
 /// `Both` is expanded into two walks before reaching SQL, so it never arrives
 /// here; it borrows `Inbound`'s columns to keep the match exhaustive without a
 /// panic.
 fn columns(direction: Direction) -> (&'static str, &'static str, &'static str) {

---- store::graph::tests::a_cycle_terminates stdout ----

thread 'store::graph::tests::a_cycle_terminates' (32710619) panicked at crates/keel-core/src/store/graph.rs:601:72:

---- store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label stdout ----

thread 'store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label' (32710620) panicked at crates/keel-core/src/store/graph.rs:692:14:

---- store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path stdout ----

thread 'store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path' (32710622) panicked at crates/keel-core/src/store/graph.rs:535:71:

failures:
    store::graph::tests::a_cycle_terminates
    store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label
    store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path
    store::graph::tests::a_rels_filter_returns_only_what_was_asked_for
    store::graph::tests::an_archived_edge_is_not_walked
    store::graph::tests::blocks_runs_blocker_to_blocked
    store::graph::tests::both_unions_the_two_walks_without_wandering
    store::graph::tests::depends_on_is_never_stored_and_matches_nothing
    store::graph::tests::depth_is_clamped_to_max_depth
    store::graph::tests::derived_from_runs_spec_to_feedback
    store::graph::tests::duplicates_runs_task_to_task
    store::graph::tests::implements_runs_task_to_spec

test result: FAILED. 270 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
