*** crates/keel-core/src/store/graph.rs:86:5: replace columns -> (&'static str, &'static str, &'static str) with ("", "", "xyzzy")

*** mutation diff:
--- crates/keel-core/src/store/graph.rs
+++ replace columns -> (&'static str, &'static str, &'static str) with ("", "", "xyzzy")
@@ -78,20 +78,17 @@
 }
 
 /// The columns a traversal matches on and yields, for one direction.
 ///
 /// `Both` is expanded into two walks before reaching SQL, so it never arrives
 /// here; it borrows `Inbound`'s columns to keep the match exhaustive without a
 /// panic.
 fn columns(direction: Direction) -> (&'static str, &'static str, &'static str) {
-    match direction {
-        Direction::Outbound => ("from_id", "to_id", "to_type"),
-        Direction::Inbound | Direction::Both => ("to_id", "from_id", "from_type"),
-    }
+    ("", "", "xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 /// Rebuild one traversal row.
 fn read_neighbour(row: &Row<'_>) -> Result<Neighbour> {
     let e = |c: &'static str| Error::storage(format!("read column `{c}` of a traversal row"));
 
     let id = EntityId::parse(&row.get::<_, String>("id").map_err(e("id"))?)?;
     let entity_type = EntityType::parse(

---- store::graph::tests::a_cycle_terminates stdout ----

thread 'store::graph::tests::a_cycle_terminates' (32720653) panicked at crates/keel-core/src/store/graph.rs:611:72:

---- store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label stdout ----

thread 'store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label' (32720654) panicked at crates/keel-core/src/store/graph.rs:702:14:

---- store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path stdout ----

thread 'store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path' (32720656) panicked at crates/keel-core/src/store/graph.rs:545:71:

failures:
    store::graph::tests::a_cycle_terminates
    store::graph::tests::a_dangling_edge_is_returned_with_an_empty_label
    store::graph::tests::a_multi_hop_walk_reports_depth_and_the_whole_path
    store::graph::tests::a_rels_filter_returns_only_what_was_asked_for
    store::graph::tests::an_archived_edge_is_not_walked
    store::graph::tests::blocks_runs_blocker_to_blocked
    store::graph::tests::both_unions_the_two_walks_without_wandering
    store::graph::tests::depends_on_is_never_stored_and_matches_nothing
    store::graph::tests::depth_is_clamped_to_max_depth
    store::graph::tests::derived_from_runs_spec_to_feedback
    store::graph::tests::duplicates_runs_task_to_task
    store::graph::tests::implements_runs_task_to_spec

test result: FAILED. 270 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
